Repository: WPPlugins/gwyns-imagemap-selector
Catalog: gwyns-imagemap-selector-*.po
Languages: pt_pt

source: Imagemap Creator
pt_pt: Criador de imagemaps

source: Instructions
pt_pt: Instruções de utilização

source: Settings
pt_pt: Opções

source: Gwyn's Imagemap Selector
pt_pt: Gwyn selector de imagemaps

source: You do not have sufficient permissions to access this page.
pt_pt: Não tem permissões suficientes para aceder a esta página.

source: Save Settings
pt_pt: Gravar opções

source: Error
pt_pt: Erro

source: This page should have never been displayed!
pt_pt: Esta página nunca deveria ter sido mostrada!

source: This imagemap inserted by
pt_pt: Este imagemap foi inserido pelo

source: No valid category, tag, or generic query
pt_pt: Não foi encontrada nenhuma query válida para categoria, tag ou query livre

source: No imagemap data found
pt_pt: Não foi encontrado nenhum imagemap

source: Options
pt_pt: Opções

source: Debug mode
pt_pt: Modo de debug

source: Pop-Up URL
pt_pt: URL do Popup

source: Pop-Up CSS
pt_pt: CSS do pop-up

source: Settings for
pt_pt: Opções de configuração para

source: Debug mode adds further comments on outputted HTML
pt_pt: O modo de debug acrescenta mais comentários no HTML emitido

source: External pop-up link
pt_pt: Link (URL) para pop-up externo

source: Inline CSS for popup styling
pt_pt: CSS para o design do popup

source: Uses the online editor as described by Adam Maschek in <a href="http://www.maschek.hu/imagemap/imgmap">http://www.maschek.hu/imagemap/imgmap</a>; you can go to that page to get more help.
pt_pt: Usa o editor online de imagemaps tal como descrito por Adam Maschek em <a href="http://www.maschek.hu/imagemap/imgmap">http://www.maschek.hu/imagemap/imgmap</a>; clique nessa página para obter mais ajuda.

source: Select source
pt_pt: Escolha uma imagem

source: An image from the Media Library
pt_pt: Imagem da Biblioteca de Media

source: Get image
pt_pt: Ver imagem

source: accept
pt_pt: aceitar

source: Image map areas
pt_pt: Áreas do imagemap

source: Add new area
pt_pt: Nova área

source: Delete selected area
pt_pt: Apagar área seleccionada

source: Preview image map
pt_pt: Prever imagemap

source: Get image map HTML
pt_pt: Obter HTML do imagemap

source: Zoom:
pt_pt: Ampliação:

source: WordPress shortcodes
pt_pt: Shortcodes para WordPress

source: Standard imagemap
pt_pt: Imagemap standard

source: CSS imagemap
pt_pt: Imagemap com CSS

source: Wiki imagemap
pt_pt: Imagemap para Wiki

source: More actions
pt_pt: Mais acções

source: bounding box
pt_pt: caixa envolvente

source: background color
pt_pt: cor de fundo

source: No labeling
pt_pt: Sem etiquetas

source: Label with numbers
pt_pt: Etiquetar com números

source: Label with alt text
pt_pt: Etiquetar com texto no campo alt

source: Label with href
pt_pt: Etiquetar com href

source: Label with coords
pt_pt: Etiquetar com coordenadas

source: Image
pt_pt: Imagem

source: Status
pt_pt: Estado

source: Code
pt_pt: Código

source: uses shortcodes to define imagemaps, assign an image to it, and automatically make queries on the WordPress database to extract the appropriate links.
pt_pt: usa "shortcodes" para definir imagemaps, atribuir-lhes uma imagem e fazer queries na base de dados do WordPress para automaticamente extrair os links apropriados.

source: There are two basic usages of this plugin. The first is if you know exactly which URLs are linked to each area of the imagemap. This is appropriate for menus (and very likely used on a widget) that will not change much over time. This uses the "direct" approach and requires URLs to be explicitly named on each area; thus, it's quite similar to directly placing the imagemap HTML inside the post/page/widget (the only advantage of using the shortcode is to get automatic ids).
pt_pt: Existem duas utilizações básicas deste plugin. A primeira é usada se se souber exactamente quais URLs vão ser linkados a cada uma das áreas do imagemap. Isto é apropriado para menus (e será muito provavelmente usado dentro de um widget) que não mudem muito com o tempo. Isto usa a abordagem "directa" e necessita que cada URL seja explicitamente indicado em cada área; ou seja, é muito semelhante a colocar o HTML apropriado para um imagemap directamente dentro do post, página ou widget (a única vantagem neste caso é na geração automática de identificadores para CSS).

source: The second variant makes a query on the WordPress database and returns the appropriate permalinks for each post. You can query by category, tag, or even add a free query (it will be passed to WP_Query so the same syntax applies; see <a href="http://codex.wordpress.org/Function_Reference/WP_Query">http://codex.wordpress.org/Function_Reference/WP_Query</a>). The order of permalinks thus retrieved will dynamically be assigned to each area (in the order those are written). If there are more areas than permalinks, the remaining areas will be ignored (the reverse situation is undefined). Category and tag queries can be made by name or id and can be retrieved either in the descending (default) or ascending order.
pt_pt: A segunda variante de utilização faz uma query na base de dados do WordPress e retorna os permalinks apropriados para cada post. Pode fazer esta query por categoria, tag ou mesmo uma query livre (será passada a WP_Query pelo que se aplica a mesma sintaxe; consulte como referência <a href="http://codex.wordpress.org/Function_Reference/WP_Query">http://codex.wordpress.org/Function_Reference/WP_Query</a>). A ordem dos permalinks devolvida desta forma será dinamicamente atribuída a cada área (pela ordem que foram colocadas). Se existirem mais áreas que permalinks, as restantes áreas serão ignoradas (a situação inversa não está definida). As queries por categoria ou tag podem ser feitas por nome ou id e podem ser ordenadas de forma descendente (por omissão) ou ascendente.

source: A few extra parameters are available to add names, titles, ids, and classes. If those are omitted, this plugin will provide "best effort" alternatives to comply with HTML guidelines. This also allows for extra styling.
pt_pt: Existem alguns parâmetros adicionais para acrescentar nomes, títulos, ids e classes. Se estes forem omitidos, este plugin irá fazer um esforço para inserir alternativas que estejam conforme as normas do HTML. Isto permite depois a utilização de estilos via CSS.

source: The overall syntax is:
pt_pt: A sintaxe é:

source: [imagemap (category=["category id"|"category name"] | category_name="category name" | tag=["tag id"|"tag name"] | tag_name="tag name" | query="a WP_QUERY string") | direct=[0|1] img="/your/url/to/image" title="Image title" order=["DESC"|"ASC"] nopaging=["true"|"false"] map="imagemap name" id="HTML id" class="CSS style" alt="Alt text for the image" popup="true|false" thumbnail="true|false" excerpt="true|false"] [area shape=["rect"|"poly"|"circle"] url="/direct/link/for/this/area alt="name for this area" class="CSS style" target=["_self"|"_blank"|"_top"|...] title="name for this area"]coord1,coord2,coord3,...,coordN[/area] [/imagemap]</pre>
pt_pt: [imagemap (category=["id da categoria"|"nome da categoria"] | category_name="nome da categoria" | tag=["id da tag"|"nome da tag"] | tag_name="nome da tag" | query="uma string de query tipo WP_QUERY") | direct=[0|1] img="/o/seu/url/para/a/imagem" title="Título da imagem" order=["DESC"|"ASC"] nopaging=["true"|"false"] map="nome do imagemap" id="id HTML" class="CSS style" alt="Texto alternativo para a imagem" popup="true|false" thumbnail="true|false" excerpt="true|false"] [area shape=["rect"|"poly"|"circle"] url="/link/directo/para/esta/área alt="nome para esta área" class="CSS style" target=["_self"|"_blank"|"_top"|…] title="nome para esta área"]coord1,coord2,coord3,…,coordN[/area] [/imagemap]</pre>

source: Thus, imagemaps can be either in direct mode (direct=1) or in query mode (omit the direct clause). When in query mode, you can use query by categories (id or name/slug), tags (id or name), or a free query that complies with WP_Query types of queries. Queries by category or tag can be made in descending (default; can be omitted) or ascending order (this parameter is ignored when using a WP_Query-compliant query instead). The <code>img</code> parameter is mandatory. <code>map</code>, <code>id</code>, <code>class</code>, and <code>alt</code> are all optional and a best effort to fill them with plausible values will be provided.
pt_pt: Logo, imagemaps podem estar ou no modo directo (direct=1) ou no modo query (neste caso, por favor omita o parâmetro "direct"). Quando em modo query, pode utilizar queris por categorias (seja pelo id, seja pelo nome/slug), tags (pelo id ou pelo nome), ou em modo de query livre, que terá de estar conforme os tipos de queries WP_Query possíveis. As queries por categoria ou tag podem ser ordenadas de forma descendente (por omissão; o parâmetro pode ser omitido) ou ascendente (este parâmetro é normalmente ignorado quando se usa uma query livre do tipo WP_Query). O parâmetro <code>img</code> é obrigatório. Os parâmetros <code>map</code>, <code>id</code>, <code>class</code> e <code>alt</code> são todos opcionais; se forem omitidos, será feito um esforço para fornecer valores plausíveis para os mesmos.

source: Queries are usually paged, i.e. they will respect the post limit set on <code>Reading Settings > Blog pages show at most</code>. To override, use <code>nopaging="true"</code>.
pt_pt: As queries normalmente retornam resultados paginados, ou seja, irá ser respeitado o limite de posts definido em <code>Leitura > As páginas de blog mostram no máximo</code>. Para ignorar este limite, use o parâmetro <code>nopaging="true"</code>.

source: Each area has just a mandatory section, the one between [area][/area] tags. Default shape is a rectangle (<code>shape="rect"</code>) and this would require 4 coordinates (coordinate numbers are neither checked nor validated). For direct mode, an additional url for each area has to be supplied (inside the [area] tag). <code>alt</code>, <code>class</code>, and <code>title</code> are optional and they will be filled automatically with plausible values if omitted.
pt_pt: Cada área só tem uma secção obrigatória que deve ser colocada entre os marcadores [area][/area]. A forma (shape) por omissão é o rectângulo (<code>shape="rect"</code>), que requer 4 coordenadas (o número de coordenadas não é nem verificado, nem validado). Para o modo directo, é necessário acrescentar um URL adicional a cada área (dentro do marcador [area]). <code>alt</code>, <code>class</code> e <code>title</code> são opcionais e serão preenchidos automáticamente com valores plausíveis se forem omitidos.

source: Multiple categories/tags should work (as well as excluding categories/tags); note that <code>category=Uncategorized</code> will work (even though it should be <code>category_name=Uncategorized</code>) but <code>category=first,second,last</code> will not (use <code>category_name=first,second,last</code> instead).
pt_pt: Deve ser possível usar múltiplas categorias ou tags (assim como excluír categorias ou tags); note que <code>category="Sem categoria"</code> deve funcionar (embora devesse na realidade ser utilizado code>category_name="Sem categoria"</code>) mas <code>category=primeira,segunda,terceira</code> não funciona (use em vez disso <code>category_name=primeira,segunda,terceira</code>).

source: If you wish, you can get a hovering popup for the imagemap that shows the article linked to it. Use <code>popup=true</code> and you can optionally specify a thumbnail and/or just show the excerpt. CSS styling is done via the <code>class</code> parameter.
pt_pt: Se quiser, pode criar um popup flutuante para o imagemap que mostre o artigo associado à área. Para isso, use <code>popup=true</code> e pode opcionalmente especificar a imagem reduzida do artigo (thumbnail) e/ou mostrar apenas um excerto do artigo. Pode ser aplicado um estilo CSS através do parâmetro <code>class</code>.

source: You can also specify your own AJAX handler and call it remotely instead of using the built-in handler. All parameters are passed via <code>GET</code>, and you should at least pass a post ID (parameter <code>id</code>). Optionally you can receive the CSS class for styling on the parameter <code>class</code>. <code>excerpt</code> and <code>thumbnail</code> will be set to true if the user specifies those parameters on the shortcode tag for the imagemap.
pt_pt: Também pode especificar o seu próprio script de recepção das chamadas AJAX e chamá-lo remotamente em vez do pré-definido. Todos os parâmetros são passados via <code>GET</code>, e deve pelo menos enviar o ID do post (parâmetro <code>id</code>). Opcionalmente pode receber também a classe CSS para o design através do parâmetro <code>class</code>. Os parâmetros <code>excerpt</code> e <code>thumbnail</code> terão sido inicializados se o utilizador os especificar no shortcode do imagemap.

source: Also, several imagemaps with the same name in the same post/page/widget haven't been tested either. In theory you could define an imagemap <em>without</em> an associated image, and insert images and change manually the imagemap for each, so that the same imagemap is used across several images in the same page. None of this was tested.
pt_pt: Também não foi testada a utilização de vários imagemaps com o mesmo nome no mesmo post/página/artigo (não deve funcionar). Em teoria é possível definir um imagemap <em>sem</em> uma imagem associada, inserir depois manualmente uma imagem e associar-lhe manualmente o imagemap apropriado, de forma a permitir que o mesmo imagemap seja usado em várias imagens na mesma página. Nada disto foi testado.

source: Imagemaps can be conveniently created from the Imagemap Creator tab, which uses <a href="http://code.google.com/p/imgmap/">Adam Maschek's imgmap Javascript library</a> to provide an interactive, Web-based imagemap creator.
pt_pt: Os imagemaps podem ser convenientemente criados a partir do tab do Criador de Imagemaps, que usa a <a href="http://code.google.com/p/imgmap/">biblioteca imgmap em Javascript de Adam Maschek</a> para fornecer um editor interactivo de imagemaps baseado na Web.

source: The plugin will now work for anyone with read capabilities (and not only administrators), but only administrators have access to the "Settings" tab.
pt_pt: Este plugin agora funciona para qualquer utilizador que tenha capacidades de leitura (e não apenas de administração), mas só os administradores é que têm acesso à aba de "Opções".

source: Warning: this plugin will not work with any automatic image-resizing mechanisms (e.g. Jetpack's Photon or similar tools, specially those for dynamic/fluid themes which resize images for mobile viewing). This is a limitation of the <code>imagemap</code> HTML command, which is very simple and basic, and relies upon absolute values relative to an image's dimensions, which are supposed to be known in advance. There are a few techniques to rewrite imagemaps (basically recalculating the selection areas based on the redimensioned image), but these are a bit pointless for the purpose of this plugin, which totally avoids Javascript (for browsers which have it turned off), and there are already better, Javascript/Flash/Java-based solutions which allow clickable areas on resized images.
pt_pt: Aviso: este plugin não funciona com nenhum mecanismo de redimensionamento automático (por exemplo, o Photon do Jetpack ou ferramentas semelhantes, nomeadamente as que lidam com o redimensionamento de imagens em temas dinâmicos/fluidos para plataformas móveis). Esta é uma limitação do comando HTML <code>imagemap</code>, que é muito simples e básico, e que depende de valores absolutos da dimensão das imagens, que supostamente são conhecidos <em>a priori</em>. Existem algumas técnicas para re-escrever imagemaps (basicamente recalculando as áreas de selecção a partir dos valores da imagem redimensionada), mas estas são um pouco inúteis para o propósito deste plugin, que evita completamente a utilização de Javascript (para browsers que o tenham desligado), e já existem soluções bem melhores, baseadas em Javascript/Flash/Java, que permitem a selecção de áreas clicáveis em imagens redimensionadas.

source: Choose
pt_pt: Escolher
